Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/leave_and_holidays/public_holidays_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: There are 9 public holidays in Ireland each year
ga: Bíonn 9 gcinn de laethanta saoire phoiblí in Éirinn gach bliain

source: Public holidays may commemorate a special day or other event, for example, St Patrick's Day (17 March) or Christmas Day (25 December)
ga: Déanann laethanta saoire phoiblí comóradh ar laethanta nó imeachtaí ar leith, Lá Fhéile Pádraig (17 Márta), mar shampla, nó Lá Nollag (25 Mí na Nollag)

source: On a public holiday, sometimes called a bank holiday, most businesses and schools close
ga: Bíonn tromlach scoileanna agus gnóthaí dúnta ar laethanta saoire phoiblí ach bíonn seirbhísí áirithe, iompar poiblí, mar shampla, fós ag dul, ach go mbíonn sceidil srianta i bhfeidhm

source: Other services, for example, public transport still operate but often with restricted schedules
ga: Seo a leanas liosta de na laethanta saoire phoiblí a bhíonn ann in aghaidh na bliana:

source: • New Year's Day (1 January)
ga: • Lá Caille (1 Eanáir)

source: • St. Patrick's Day (17 March)
ga: • Lá Fhéile Pádraig (17 Márta)

source: • First Monday in May, June, August
ga: • An Chéad Luan i mBealtaine, Meitheamh, Lúnasa

source: • Last Monday in October
ga: • An Luan Deireanach i mí Dheireadh Fómhair

source: • Christmas Day (25 December)
ga: • Lá Nollag (25 Mí na Nollag)

source: • St. Stephen's Day (26 December)
ga: • Lá Fhéile Stiofáin (26 Mí na Nollag)

source: Good Friday is not a public holiday
ga: Ní saoire phoiblí í Aoine an Chéasta

source: While some schools and businesses close on that day, you have no automatic entitlement to time off work on that day
ga: Cé go ndúntar scoileanna agus gnóthaí ar an lá sin, níl aon teidlíocht uathrialach agat i gcomhair am saor ar an lá sin

source: How is the date of Easter Monday determined each year?
ga: Conas a dhéantar dáta Luan Cásca a shocrú gach bliain?

source: Easter Monday is the only public holiday that can vary significantly from year to year
ga: Luan Cásca an t-aon saoire poiblí a n-athraíonn go suntasach ó bhliain go bliain

source: The date of Easter moves every year within the international calendar for civil use
ga: Athraíonn dáta na Cásca le haghaidh úsáid shibhialta gach bliain taobh istigh den fhéilire idirnáisiúnta

source: Broadly speaking, Easter should be the first Sunday after the first full moon occurring on or after 21 March
ga: De ghnáth beidh Domhnach Cásca ar an gcéad Dhomhnach tar éis an chéad ghealach lán ar, nó i ndiaidh 21 Márta

source: This means that the earliest possible date for Easter Sunday in any year is 22 March, the latest is 25 April
ga: Ciallaíonn seo gurb é 22 Márta an dáta is luaithe do Dhomhnach Cásca agus 25 Aibreán an ceann is deireanaí in aon bhliain

source: Easter Monday will fall on the following dates between 2017 and 2020: 17 April 2017, 2 April 2018, 22 April 2019, 13 April 2020
ga: Beidh Luan Cásca ar na dátaí seo a leanas idir 2017 agus 2020: 17 Aibreán 2017, 2 Aibreán 2018, 22 Aibreán 2019, 13 Aibreán 2020

source: Your entitlement to public holidays is set out in the Organisation of Working Time Act 1997
ga: Leagtar do theidlíocht i gcomhair saoire phoiblí amach san Acht um Eagrú Ama Oibre 1997

source: Most employees are entitled to paid leave on public holidays
ga: Bíonn tromlach na bhfostaithe i dteideal saoire le pá ar na laethanta saoire phoiblí

source: One exception is part-time employees who have not worked for their employer at least 40 hours in total in the 5 weeks before the public holiday
ga: Eisceacht amháin ná fostaithe páirtaimseartha nach bhfuil 40 uair oibre ar a laghad déanta acu sna 5 seachtaine roimh an lá saoire poiblí

source: Employees who qualify for public holiday benefit will be entitled to one of the following:
ga: Beidh fostaithe incháilithe i dteideal mar a leanas:

source: • A paid day off on the public holiday
ga: • Lá íoctha saor ar an tsaoire phoiblí

source: • An additional day of annual leave
ga: • Lá breise saoire bhliantúil

source: • An additional day's pay
ga: • Pá lae sa bhreis

source: • A paid day off within a month of the public holiday
ga: • Lá íoctha saor laistigh de mhí amháin ón tsaoire phoiblí

source: The Organisation of Working Time Act provides that you may ask your employer at least 21 days before a public holiday, which of the alternatives will apply
ga: De bharr an Achta um Eagrú Ama Oibre tig leat iarraidh ar d'fhostóir 21 lá roimh an tsaoire phoiblí, cé acu a bheas i gceist

source: If your employer fails to respond at least 14 days before the public holiday, you are entitled to take the actual public holiday as a paid day off
ga: Mura bhfreagraíonn d'fhostóir 14 lá roimh an tsaoire, tá de cheart agat an lá a thógáil mar lá saor le pá

source: The Organisation of Working Time (Determination of Pay For Holidays) Regulations (SI 475/1997) set out the appropriate rate of daily pay
ga: Leagann na Rialacháin Acht um Eagrú Ama Oibre (Cinneadh Phá Saoire) 1997 (SI 475/1997) síos ráta phá laethúil cuí

source: If you have worked for your employer at least 40 hours in the 5 weeks before the public holiday and the public holiday falls on a day you normally work you are entitled to a day's pay for the public holiday
ga: Má tá 40 uair oibre ar a laghad déanta agat sna 5 seachtaine roimh an lá saoire poiblí agus titeann an lá saoire ar lá a oibríonn tú de ghnáth, beidh tú i dteideal pá lae i gcomhair an lae saoire poiblí

source: If you are required to work that day you are entitled to an additional day's pay
ga: Má iarrtar ort oibriú ar an lá sin beidh tú i dteideal pá lae sa bhreis

source: If you do not normally work on that particular day you should receive one-fifth of your weekly pay
ga: Mura mbíonn tú ag obair ar an lá saor ba chóir an cúigiú cuid dá do phá seachtainiúil a thabhairt duit

source: Even if you may never be rostered to work on a public holiday you are entitled to one-fifth of your weekly pay as compensation for the public holiday
ga: Fiú mura n-iarrtar ort riamh oibriú ar lá saoire phoiblí, ta tú i dteideal an cúigiú cuid dá do phá seachtainiúil mar chúiteamh i leith saoire phoiblí

source: If you do not have normal daily or weekly working hours, under SI 475/1997, an average of your day’s pay or the fifth of your weekly pay is calculated over the 13 weeks you worked before the public holiday
ga: Mura bhfuil gnáthuaireanta oibre lae nó seachtainiúla agat, de réir IR 475/1997, déanfar meán do phá lae nó an cúigiú cuid dá do phá seachtainiúil ar feadh 13 seachtain oibrithe roimh an tsaoire phoiblí a ríomh

source: In all of the above situations your employer may choose to give you paid time off instead of pay for the public holiday
ga: Más ann d'aon cheann de na cúinsí thuas, is féidir d'fhostóir saoire íoctha in áit phá a thabhairt duit mar do theidlíocht i gcomhair saoire phoiblí

source: Sick leave on a public holiday
ga: Saoire thinnis le linn laethanta poiblí

source: If you are a full time worker on sick leave during a public holiday, you are entitled to benefit for the public holiday you missed, as described above
ga: Más oibrí lánaimseartha tú atá ar saoire breoiteachta i rith lae/laethanta saoire phoiblí, tá tú i dteideal sochar saoire poiblí a fháil ón obair i gcomhair an lae/na laethanta saoire phoiblí a chaill tú, mar a thuairiscítear thuas

source: If you are a part-time worker on sick leave during a public holiday, you would be entitled to benefit for the public holiday, provided you had worked for your employer for at least 40 hours in the previous five-week period - see 'Part-time employees' above
ga: Más oibrí páirtaimseartha tú ar saoire thinnis le linn lá saoire poiblí, bheifeá i dteideal sochar saoire poiblí i gcomhair an lae saoire phoiblí chomh fada is gur oibrigh tú 40 uair sa tréimhse 5 seachtaine roimhe sin -féach 'Fostaithe páirtaimseartha' thuas

source: However, if you have been off work for more than 26 consecutive weeks due to illness or accident, or for more than 52 weeks due to an occupational accident and you are absent from work immediately before the public holiday because of this, you are not entitled to the public holiday
ga: Má tá tú neamhláithreach ó obair le níos mó ná 26 seachtaine as a chéile de bharr tinnis nó timpiste, agus i gcás tionóisce cheirde 52 seachtaine agus dá bhrí sin á tá tú neamhláithreach ó obair láithreach roimh an lá saoire poiblí, níl tú i dteideal an tsaoire phoiblí

source: Absence from work and public holiday entitlement
ga: Neamhláithreacht agus teidlíocht i gcomhair saoire phoiblí

source: You are entitled to leave for any public holidays that occur while you are on maternity leave, parental leave or adoptive leave
ga: Tá tú i dteideal am saor a fháil i gcomhair aon laethanta saoire phoiblí a tharlaíonn chomh fada is a bhíonn tú ar shaoire mháithreachais, tuismitheora nó uchtála

source: These rights are set down in law in the Maternity Protection Acts 1994 and 2004, the Parental Leave Acts 1998 and 2006, and the Adoptive Leave Acts 1995 and 2005 respectively
ga: Leagtar na cearta dlíthiúla seo amach sna hAchtanna um Chosaint Mháithreachais 1994 agus 2004, sna hAchtanna um Shaoire do Thuismitheoirí 1998 agus 2006, agus sna hAchtanna um Shaoire Uchtaíoch 1995 agus 2005 faoi seach

source: You are not entitled to public holiday benefits if you have been absent from work immediately before the public holiday and your absence is:
ga: Má tá tú neamhláithreach ó obair díreach roimh shaoire phoiblí ní bheidh tú i dteideal am saor a fháil i gcomhair aon laethanta saoire phoiblí sna cásanna seo a leanas:

source: • Over 13 weeks, due to lay off or some other reason and authorised by your employer
ga: • Tá tú ar stailc • Tá do neamhláithreacht níos mó ná 13 seachtaine mar gheall ar asleagan nó cúis eile agus tá sí faofa ag d'fhostóir

source: • Due to a strike • After the first 13 weeks of carer's leave
ga: • Tá tú ar shaoire cúramóra níos mó ná 13 seachtaine

source: If your employment finishes during the week ending on the day before a public holiday and you have worked for your employer for the previous 4 weeks, you should receive an additional day's pay for the public holiday
ga: Má thagann deireadh le d’fhostaíocht sa tseachtain dar críoch lá roimh saoire poiblí, agus má bhí tú ag obair le d’fhostóir i rith na 4 seachtaine roimhe sin, ba chóir go bhfaighfeá pá lae bhreise le haghaidh na saoire poiblí sin

source: This also applies to part-time employees who have established a right to the public holiday by working at least 40 hours in the previous 5 weeks
ga: Baineann sé seo le fostaithe páirtaimseartha a chruthaigh ceart don tsaoire poiblí dóibh féin trí 40 uaire oibre a dhéanamh sna 5 seachtaine roimhe sin

source: You can read more about this in 'Further information' below
ga: Is féidir leat tuilleadh a léamh faoi sin in 'Tuilleadh faisnéise' thíos

source: Public holidays falling on a weekend
ga: Laethanta saoire phoiblí le linn deireadh seachtaine

source: Where a public holiday falls on a weekend, you do not have any automatic legal entitlement to have the next working day off work
ga: Mar a thiteann lá saoire poiblí ar dheireadh seachtaine, sa ghnáthchúrsa ní bhíonn teidlíocht dhlíthiúil agat go mbeadh an chéad lá oibre eile saor ón obair agat

source: This occurred in 2016/2017 when Christmas Day (25 December) and New Year's Day (1 January) fell on a Sunday
ga: Tarlaíonn seo i 2016 nuair beidh Lá Nollag (25 Mí na Nollag) ar Dhomhnach

source: You can find out more about your public holiday entitlement for your individual working arrangement in this explanatory booklet on holidays and public holidays (pdf)
ga: An toradh a bhí leis seo ná nár lá saoire poiblí é Máirt 27 Mí na Nollag 2016. Is ceadmhach do d'fhostóir iallach a chur ort freastal ar an obair ar an lá sin

source: You can find out more about public holidays in this explanatory booklet on holidays and public holidays (pdf) or from the Workplace Relations Commission's Information and Customer Service - see 'Where to apply' below
ga: Is féidir leat leabhrán mínithe faoi shaoire agus laethanta saoire phoiblí (pdf) a léamh anseo nó téigh i dteagmháil leis na Seirbhís Faisnéise do Chustaiméirí an Choimisiúin um Chaidreamh san Áit Oibre – féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos

source: If you are not getting your public holiday entitlement you may make a complaint under the Organisation of Working Time Act within 6 months of the dispute or complaint occurring
ga: Mura bhfuil tú ag fáil a bhfuil dlite agat maidir le saoire phoiblí is féidir gearán a dhéanamh de réir An Achta um Eagrú Ama Oibre 1997

source: You must use the online complaint form available on workplacerelations.ie
ga: Caithfidh tú an fhoirm ghearáin ar líne nua a úsáid á fáil ar workplacerelations.ie

source: The time limit may be extended for up to a further 6 months, but only where there is a reasonable cause which prevented the complaint being brought within the normal time limit
ga: Ní mór duit gearán a dhéanamh laistigh de 6 mhí. Is féidir síneadh ama 6 mhí eile a thabhairt duit ach ní dhéanfar é sin mura bhfuil cúinsí réasúnacha ann a chuir cosc ort an gearán a dhéanamh laistigh den gnáth-thréimhse ama

source: Information and Customer Service
ga: Seirbhíse Faisnéise agus Custaiméara

source: Opening Hours: Mon. to Fri. 9.30am to 5pm
ga: Uaireanta Oscailte:Luan go hAoine 9.30rn go 5in

source: Tel: (059) 917 8990
ga: Teil: (059) 917 8990

source: Locall: 1890 80 80 90
ga: Lóghlao: 1890 80 80 90

source: Termination of employment and public holidays
ga: Foirceannadh fostaíochta agus laethanta saoire poiblí

source: In the case of Gazboro Ltd
ga: I gcás Gazboro Ltd

source: -v- BATU (DWT9916) the claimants ceased to be employed on 18 December 1998
ga: -v- BATU (DWT9916), scoir na héilitheoirí de bheith fostaithe an 18 Nollaig 1998

source: They claimed an entitlement to be paid in respect of 25 and 26 December
ga: D’éiligh siad go n-íocfaí teidlíocht i leith an 25 agus an 26 Nollaig

source: As the Court interpreted the wording of Section 23(2)(a) of the Organisation of Working Time Act 1997, the week ending at midnight on 24 December began at midnight on 18 December
ga: De réir thuiscint na Cúirte ar foclaíocht Alt 23(2)(a) den Acht um Eagrú Ama Oibre, 1997, ba ag meán oíche an 18 Nollaig a thosaigh an tseachtain dar chríoch mheán oíche an 24 Nollaig

source: Since the claimants worked for the employer during the 4 weeks preceding that week they were entitled to an additional day's pay in respect of 25 December
ga: Toisc gur oibrigh na héilitheoirí don fhostóir le linn na 4 seachtaine roimh an tseachtain sin, bhí siad i dteideal pá lae bhreise i ndáil leis an 25 Nollaig

source: The week ending on 25 December began at midnight on 19 December
ga: Ba ag meán oíche an 19 Nollaig a thosaigh an tseachtain dar chríoch an 25 Nollaig

source: Since the claimants ceased to be employed on 18 December they had no entitlement under the Act in respect of 26 December
ga: Ós rud é gur scoir na héilitheoirí de bheith fostaithe an 18 Nollaig, ní raibh aon teidlíocht acu faoin Acht i ndáil leis an 26 Nollaig
